countries = {
    "Україна": {
        "Площа": "603 548 км²",
        "Населення": "36 млн осіб",
        "Частина світу": "Європа"
    },
    "Франція": {
        "Площа": "551 695 км²",
        "Населення": "68 млн осіб",
        "Частина світу": "Європа"
    },
    "Канада": {
        "Площа": "9 984 670 км²",
        "Населення": "40 млн осіб",
        "Частина світу": "Північна Америка"
    },
    "Бразилія": {
        "Площа": "8 515 767 км²",
        "Населення": "216 млн осіб",
        "Частина світу": "Південна Америка"
    },
    "Китай": {
        "Площа": "9 596 961 км²",
        "Населення": "1,41 млрд осіб",
        "Частина світу": "Азія"
    },
    "Японія": {
        "Площа": "377 975 км²",
        "Населення": "125 млн осіб",
        "Частина світу": "Азія"
    },
    "Єгипет": {
        "Площа": "1 001 449 км²",
        "Населення": "113 млн осіб",
        "Частина світу": "Африка"
    },
    "Австралія": {
        "Площа": "7 692 024 км²",
        "Населення": "27 млн осіб",
        "Частина світу": "Австралія"
    },
    "США": {
        "Площа": "9 833 520 км²",
        "Населення": "341 млн осіб",
        "Частина світу": "Північна Америка"
    },
    "Німеччина": {
        "Площа": "357 588 км²",
        "Населення": "84 млн осіб",
        "Частина світу": "Європа"
    }
}
flag=False
print("Країни, що знаходяться у Африці або Азії:")
for country, info in countries.items():
    if info["Частина світу"] == "Африка" or info["Частина світу"] == "Азія":
        print(f"{country}: {info}")
        flag=True
if not flag:
    print("У заданому словнику відсутні країни з Африки або Азії")