#Створення словника
students={
    "Гиренко Ілля Романович":{
        'Група': "КН41/1",
        'Курс':1,
        'Предмети та оцінки за семестр':{
            "Вища математика":80,
            "Програмування":81,
            "Дискретна математика":85
        }
    },
    "Мартиненко Олександр Володимирович":{
            'Група': "КН41/1",
            'Курс':1,
            'Предмети та оцінки за семестр':{
                "Вища математика":83,
                "Програмування":82,
                "Дискретна математика":84
            }
        },
    "Репін Данііл Вікторович":{
            'Група': "КН41/1",
            'Курс':1,
            'Предмети та оцінки за семестр':{
                "Вища математика":89,
                "Програмування":80,
                "Дискретна математика":87
            }
        },
    "Спічаков Павло Ігорович":{
            'Група': "КН41/1",
            'Курс':1,
            'Предмети та оцінки за семестр':{
                "Вища математика":80,
                "Програмування":90,
                "Дискретна математика":82
            }
        }
}

#Функція Гиренка І. Р.
#Додавання нового студента до словника
def add_student(students):
    name=input("Введіть повне ім'я нового студента: ")
    group=input("Введіть групу студента: ")
    course=int(input("Введіть курс студента: "))
    subjects={}
    print("\nВведіть предмети та оцінки за семестр (для завершення введення введіть порожню назву\n")
    while True:
        subject=input("Назва предмета: ")
        if subject == "":
            break
        try:
            grade = int(input(f"Оцінка з предмета '{subject}': "))
        except ValueError:
            print("Будь ласка, введіть числове значення оцінки.")
            continue
        subjects[subject] = grade
    students[name] = {
            "Група": group,
            "Курс": course,
            "Предмети та оцінки за семестр": subjects
    }
    print("Студента {name} успішно додано!\n")

add_student(students)

